I am having a problem with the package
What if there is a problem with the package
What if have a issue
What if i have a problem
What if have a problem
what if i have dispute
what if i have question
i have a question
i have a dispute
i have a problem
how much i will get
how much i will be paid
how much amount i will get
how much i will pay
how do i send
how do i claim
i want a claim
how can i deliver multiple packages
how do i transport
how do i  track delivery
can i deliver multiple packages
can i track a delivery
what if i have a question
how do i cancel a transport
how can i cancel a transport
how do i cancel a package
how can i cancel a package
what can i do if a sender are a recipent is not responding
how do i get a notification
how can i get a notification
how do i get alerts
how can i get alerts
how much a service cost
how to use Ovkay services
Are there some videos that can help me better understand OvKAY?
Can I ask the Traveler to lift my package?
Can I deliver multiple packages at the same time?
Does OvKAY offer protection for a package?
How and when do I get paid?
How are Travelers matched with Senders?
How do I communicate with potential Travelers?
How do I file a claim?
How can I file a claim?
How do I send something?
How do I sign up as an OvKAY Traveler?
How do I track a delivery?
faqs
faq
FAQ's
FAQS
How do I transport a package?
How does OvKAY define shipment size?
How does a Traveler handle pick up and drop off?
How much does OvKAY service cost?
How much will I be paid per transportation?
Is there any video that can help me to better understand OvKAY?
Is there anything that I can’t send through OvKAY?
What can I send through OvKAY?
What do I do if I can’t reach the recipient when I am at the delivery location?
What do I do if a Traveler isn’t responding after confirmation of transportation?
What do I need to be an OvKAY Traveler?
What if I can no longer deliver a transportation after confirmation?
What if I have a question dispute or other problem during transporting package?
What if I need to cancel a transportation once I’ve posted it?
What if someone cancels a transportation after I’m already on my way?
What kind of automobile insurance do I need?
What to do if a Sender or Recipient is unresponsive?
What’s expected of me as an OvKAY Traveler?
When do I get charged for a transportation?
Who are OvKAY Travelers and how are they verified?
Will I be alerted when packages are posted in my area?
Will I be liable if an item is damaged while transporting?
